const shop = {
  users, //users: users
  stock: items,

  login() {
    //Написати функцію логін. Приймає обьект параметрів з { username, password }.
    //Перевіряє їх зі списом юзерів, повертає обьект користувача.
    //Якщо дані будуть не вірні, чи такого користувача не має. Залогінити його як гостя.
  },

  deposit() {
    //Написати метод, що дозволяє поповнити свій рахунок.
    //Даний метод повинен перевіряти, що користувач не гість
  },

  getListItem() {
    //Метод повертає склад, якщо юзер авторизований, чи має права гостя.
  },

  addToCard() {
    //Приймає в себе користувача та id товару
    //метод повиненн перевіряти, чи достатньо коштів у користувача, перед тим як додати товар.
  },

  getUserCard() {
    //Повртае список товарів користувача.
  },
};

function main() {
  console.log(shop);
}

main();
